<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2019 BaseALT, Ltd.  -->
<policyDefinitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <policyNamespaces>
    <target prefix="control" namespace="BaseALT.Policies.Control" />
    <using prefix="system" namespace="BaseALT.Policies.System" />
  </policyNamespaces>
  <resources minRequiredRevision="1.0" />
  <categories>
    <category name="Control" displayName="$(string.SecurityControl)">
      <parentCategory ref="system:Base" />
    </category>
    <category name="ControlSystem" displayName="$(string.ControlSystem)">
      <parentCategory ref="Control" />
    </category>
  </categories>
  <policies>
    <policy name="ExecuteSuProgram" class="Machine" displayName="$(string.ExecuteSuProgram)" explainText="$(string.ExecuteSuProgram_Help)" presentation="$(presentation.ExecuteSuProgram)" key="Software\BaseALT\Policies\Control">
      <parentCategory ref="Control" />
      <supportedOn ref="system:SUPPORTED_Sisyphus" />
      <elements>
        <enum id="ExecuteSuProgramSetter" valueName="ExecuteSuProgram" required="true">
          <item displayName="$(string.ExecuteSuProgram_Public)">
            <value>
              <decimal value="0" />
            </value>
          </item>
          <item displayName="$(string.ExecuteSuProgram_Wheel)">
            <value>
              <decimal value="1" />
            </value>
          </item>
          <item displayName="$(string.ExecuteSuProgram_WheelOnly)">
            <value>
              <decimal value="2" />
            </value>
          </item>
          <item displayName="$(string.ExecuteSuProgram_Restricted)">
            <value>
              <decimal value="3" />
            </value>
          </item>
        </enum>
      </elements>
    </policy>
  </policies>
  <policy class="Machine" displayName="$(string.chage)" explainText="$(string.chage_help)" key="Software\BaseALT\Policies\Control" name="chage" presentation="$(presentation.chage)">
    <parentCategory ref="ControlSystem"/>
    <supportedOn ref="system:SUPPORTED_AltP8"/>
    <elements>
        <enum id="chage_setter" required="true" valueName="chage">
            <enum displayName="$(string.chage_public)">
                <value>
                    <decimal value="0"/>
                </value>
            </enum>
            <enum displayName="$(string.chage_restricted)">
                <value>
                    <decimal value="1"/>
                </value>
            </enum>
        </enum>
    </elements>
 </policy>
 <policy class="Machine" displayName="$(string.chfn)" explainText="$(string.chfn_help)" key="Software\BaseALT\Policies\Control" name="chfn" presentation="$(presentation.chfn)">
    <parentCategory ref="ControlSystem"/>
    <supportedOn ref="system:SUPPORTED_AltP8"/>
    <elements>
        <enum id="chfn_setter" required="true" valueName="chfn">
            <enum displayName="$(string.chfn_public)">
                <value>
                    <decimal value="0"/>
                </value>
            </enum>
            <enum displayName="$(string.chfn_restricted)">
                <value>
                    <decimal value="1"/>
                </value>
            </enum>
        </enum>
    </elements>
 </policy>
</policyDefinitions>
