<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2023 BaseALT, Ltd.  -->
<policyDefinitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
      revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <policyNamespaces>
    <target prefix="kde" namespace="BaseALT.Policies.KDE" />
    <using prefix="system" namespace="BaseALT.Policies.System" />
  </policyNamespaces>
  <resources minRequiredRevision="1.0" />
  <policies>
  <policy name="kde-win-activate" class="Both" displayName="$(string.kde-win-activate)"
    explainText="$(string.kde-win-activate_help)"
    key="Software\BaseALT\Policies\KDE\kwinrc\Windows"
    presentation="$(presentation.kde-win-activate-user-pr)">
    <parentCategory ref="system:ALT_Settings_KDE" />
    <supportedOn ref="system:SUPPORTED_AltP10" />
      <elements>
        <enum id="kde-win-activate_setter" valueName="FocusPolicy" required="true">
          <item displayName="$(string.kde-win-act-Click_to_focus)">
            <value>
              <string>FocusFollowMouse</string>
            </value>
          </item>
          <item displayName="$(string.kde-win-act-Focus_follows_mouse)">
            <value>
              <string>FocusFollowsMouse</string>
            </value>
          </item>
          <item displayName="$(string.kde-win-act-Focus_under_mouse)">
            <value>
              <string>FocusUnderMouse</string>
            </value>
          </item>
          <item displayName="$(string.kde-win-act-Focus_under_mouse-Mp)">
            <value>
              <string>FocusStrictlyUnderMouse</string>
            </value>
          </item>
        </enum>
        <boolean id="NextFocusPrefersMouse" key="Software\BaseALT\Policies\KDE\kwinrc\Windows" valueName="NextFocusPrefersMouse">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
        <boolean id="kde-win-activate_blocker" key="Software\BaseALT\Policies\KDELocks" valueName="kwinrc.FocusPolicy">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
      </elements>
    </policy>
  <policy name="kde-win-rendering" class="Both" displayName="$(string.kde-win-rendering)"
    explainText="$(string.kde-win-rendering_help)"
    key="Software\BaseALT\Policies\KDE\kwinrc\Compositing"
    presentation="$(presentation.kde-win-rendering-user-pr)">
    <parentCategory ref="system:ALT_Settings_KDE" />
    <supportedOn ref="system:SUPPORTED_AltP10" />
      <elements>
        <enum id="kde-win-rendering_setter" valueName="LatencyPolicy" required="true">
          <item displayName="$(string.kde-win-rend-ExtremelyLow)">
            <value>
              <string>ExtremelyLow</string>
            </value>
          </item>
          <item displayName="$(string.kde-win-rend-Low)">
            <value>
              <string>Low</string>
            </value>
          </item>
          <item displayName="$(string.kde-win-rend-Medium)">
            <value>
              <string>Medium</string>
            </value>
          </item>
          <item displayName="$(string.kde-win-rend-High)">
            <value>
              <string>High</string>
            </value>
          </item>
          <item displayName="$(string.kde-win-rend-MostHigh)">
            <value>
              <string>NONE</string>
            </value>
          </item>
        </enum>
        <boolean id="kde-win-rendering_blocker" key="Software\BaseALT\Policies\KDELocks" valueName="LatencyPolicy">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
      </elements>
    </policy>
  <policy name="kde-language" class="User" displayName="$(string.kde-language)"
    explainText="$(string.kde-language_help)"
    key="Software\BaseALT\Policies\KDE"
    presentation="$(presentation.kde-language-user-pr)">
    <parentCategory ref="system:ALT_Settings_KDE" />
    <supportedOn ref="system:SUPPORTED_AltP10" />
      <elements>
        <enum id="kde-language_setter" valueName="plasma-localerc.Language" required="true">
          <item displayName="$(string.kde-language-ru)">
            <value>
              <string>{"Formats":{"LANG":"ru_RU.UTF-8"}, "Translations":{"LANGUAGE":"ru"}}</string>
            </value>
          </item>
          <item displayName="$(string.kde-language-fr)">
            <value>
              <string>{"Formats":{"LANG":"fr_FR.UTF-8"}, "Translations":{"LANGUAGE":"fr"}}</string>
            </value>
          </item>
          <item displayName="$(string.kde-language-de)">
            <value>
              <string>{"Formats":{"LANG":"de_DE.UTF-8"}, "Translations":{"LANGUAGE":"de"}}</string>
            </value>
          </item>
          <item displayName="$(string.kde-language-en-us)">
            <value>
              <string>{"Formats":{"LANG":"en_US.UTF-8"}, "Translations":{"LANGUAGE":"en_US"}}</string>
            </value>
          </item>
          <item displayName="$(string.kde-language-en-gb)">
            <value>
              <string>{"Formats":{"LANG":"en_GB.UTF-8"}, "Translations":{"LANGUAGE":"en_GB"}}</string>
            </value>
          </item>
        </enum>
        <boolean id="kde-language_blocker" key="Software\BaseALT\Policies\KDELocks" valueName="plasma.localerc.Language">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
      </elements>
    </policy>
  <policy name="kde-desktops" class="User" displayName="$(string.kde-desktops)"
    explainText="$(string.kde-desktops_help)"
    key="Software\BaseALT\Policies\KDE\kwinrc\Desktops"
    presentation="$(presentation.kde-desktops-user-pr)">
    <parentCategory ref="system:ALT_Settings_KDE" />
    <supportedOn ref="system:SUPPORTED_AltP10" />
      <elements>
        <enum id="kde-desktoprows_setter" valueName="Rows" required="true">
          <item displayName="$(string.kde-desktoprows-one)">
            <value>
              <string>1</string>
            </value>
          </item>
          <item displayName="$(string.kde-desktoprows-two)">
            <value>
              <string>2</string>
            </value>
          </item>
        </enum>
        <enum id="kde-desktopnumber_setter" valueName="Number" required="true">
          <item displayName="$(string.kde-desktopnumber-one)">
            <value>
              <string>1</string>
            </value>
          </item>
          <item displayName="$(string.kde-desktopnumber-two)">
            <value>
              <string>2</string>
            </value>
          </item>
          <item displayName="$(string.kde-desktopnumber-three)">
            <value>
              <string>3</string>
            </value>
          </item>
          <item displayName="$(string.kde-desktopnumber-four)">
            <value>
              <string>4</string>
            </value>
          </item>
        </enum>
        <boolean id="kde-desktoprows_blocker" key="Software\BaseALT\Policies\KDELocks" valueName="Rows">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
        <boolean id="kde-desktopnumber_blocker" key="Software\BaseALT\Policies\KDELocks" valueName="Number">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
      </elements>
    </policy>
  <policy name="kde-automount" class="User" displayName="$(string.kde-automount)"
    explainText="$(string.kde-automount_help)"
    key="Software\BaseALT\Policies\KDE\kded_device_automounterrc\General"
    presentation="$(presentation.kde-automount-user-pr)">
    <parentCategory ref="system:ALT_Settings_KDE" />
    <supportedOn ref="system:SUPPORTED_AltP10" />
    <elements>
      <boolean id="kde-automount_setter"  valueName="AutomountEnabled">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
      <boolean id="kde-automountonlogin_setter"  valueName="AutomountOnLogin">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
      <boolean id="kde-automountonplugin_setter"  valueName="AutomountOnPlugin">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
      <boolean id="kde-automountuknowndevices_setter"  valueName="AutomountUnknownDevices">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
        <boolean id="kde-automount_blocker" key="Software\BaseALT\Policies\KDELocks" valueName="AutomountEnabled">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
      </elements>
    </policy>
  <policy name="kde-filesearch" class="User" displayName="$(string.kde-filesearch)"
    explainText="$(string.kde-filesearch_help)"
    key="Software\BaseALT\Policies\KDE"
    presentation="$(presentation.kde-filesearch-user-pr)">
    <parentCategory ref="system:ALT_Settings_KDE" />
    <supportedOn ref="system:SUPPORTED_AltP10" />
      <elements>
        <enum id="kde-filesearch_setter" valueName="baloofilerc.FileSearch" required="true">
          <item displayName="$(string.kde-filesearch-enabled)">
            <value>
              <string>{"Basic Settings":{"Indexing-Enabled":"true"}}</string>
            </value>
          </item>
          <item displayName="$(string.kde-filesearch-indexing)">
            <value>
              <string>{"Basic Settings":{"Indexing-Enabled":"true"}, "General":{"only basic indexing":"false"}}</string>
            </value>
          </item>
          <item displayName="$(string.kde-filesearch-folders)">
            <value>
              <string>{"Basic Settings":{"Indexing-Enabled":"true"}, "General":{"index hidden folders":"true"}}</string>
            </value>
          </item>
          <item displayName="$(string.kde-filesearch-folders-and-indexing)">
            <value>
              <string>{"Basic Settings":{"Indexing-Enabled":"true"}, "General":{"index hidden folders":"true", "only basic indexing":"false"}}</string>
            </value>
          </item>
        </enum>
        <boolean id="kde-filesearch_blocker" key="Software\BaseALT\Policies\KDELocks" valueName="baloofilerc.FileSearch">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
      </elements>
    </policy>
  <policy name="kde-iconstheme" class="User" displayName="$(string.kde-iconstheme)"
    explainText="$(string.kde-iconstheme_help)"
    presentation="$(presentation.kde-iconstheme-user-pr)"
    key="Software\BaseALT\Policies\KDE">
    <parentCategory ref="system:ALT_Appearance_KDE" />
    <supportedOn ref="system:SUPPORTED_AltP10" />
      <elements>
        <enum  id="kde-iconstheme-setter" valueName="kdeglobals.Icons" required="true">
          <item displayName="$(string.kde-icons-breeze)">
            <value>
              <string>{"Icons":{"Theme":"breeze"}}</string>
            </value>
          </item>
          <item displayName="$(string.kde-icons-breeze-dark)">
            <value>
              <string>{"Icons":{"Theme":"breeze-dark"}}</string>
            </value>
          </item>
          <item displayName="$(string.kde-icons-Adwaita)">
            <value>
              <string>{"Icons":{"Theme":"Adwaita"}}</string>
            </value>
          </item>
          <item displayName="$(string.kde-icons-oxygen)">
            <value>
              <string>{"Icons":{"Theme":"oxygen"}}</string>
            </value>
          </item>
          <item displayName="$(string.kde-icons-gnome)">
            <value>
              <string>{"Icons":{"Theme":"gnome"}}</string>
            </value>
          </item>
        </enum>
        <boolean id="kde-iconstheme_blocker" key="Software\BaseALT\Policies\KDELocks" valueName="kdeglobals.Icons" >
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
      </elements>
    </policy>
  <policy name="kde-look-and-feel" class="User" displayName="$(string.kde-look-and-feel)"
    explainText="$(string.kde-look-and-feel_help)"
    presentation="$(presentation.kde-look-and-feel-user-pr)"
    key="Software\BaseALT\Policies\KDE\kdeglobals\KDE">
    <parentCategory ref="system:ALT_Appearance_KDE" />
    <supportedOn ref="system:SUPPORTED_AltP10" />
      <elements>
        <enum  id="kde-look-and-feel-setter" valueName="LookAndFeelPackage" required="true">
          <item displayName="$(string.kde-look-and-feel-breeze)">
            <value>
              <string>org.kde.breeze.desktop</string>
            </value>
          </item>
          <item displayName="$(string.kde-look-and-feel-breeze-dark)">
            <value>
              <string>org.kde.breezedark.desktop</string>
            </value>
          </item>
          <item displayName="$(string.kde-look-and-feel-oxygen)">
            <value>
              <string>org.kde.oxygen</string>
            </value>
          </item>
          <item displayName="$(string.kde-look-and-feel-breezetwilight)">
            <value>
              <string>org.kde.breezetwilight.desktop</string>
            </value>
          </item>
        </enum>
        <boolean id="kde-look-and-feel_blocker" key="Software\BaseALT\Policies\KDELocks" valueName="LookAndFeelPackage" >
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
      </elements>
    </policy>
  <policy name="kde-background" class="User" displayName="$(string.kde-background)"
    explainText="$(string.kde-background_help)"
    presentation="$(presentation.kde-background-user-pr)"
    key="Software\BaseALT\Policies\KDE\ksplashrc\KSplash">
    <parentCategory ref="system:ALT_Appearance_KDE" />
    <supportedOn ref="system:SUPPORTED_AltP10" />
      <elements>
        <enum  id="kde-background-setter" valueName="Theme" required="true">
          <item displayName="$(string.kde-background-breeze)">
            <value>
              <string>org.kde.breeze.desktop</string>
            </value>
          </item>
          <item displayName="$(string.kde-background-breeze-dark)">
            <value>
              <string>org.kde.breezedark.desktop</string>
            </value>
          </item>
          <item displayName="$(string.kde-background-oxygen)">
            <value>
              <string>org.kde.oxygen</string>
            </value>
          </item>
          <item displayName="$(string.kde-background-breezetwilight)">
            <value>
              <string>org.kde.breezetwilight.desktop</string>
            </value>
          </item>
        </enum>
        <boolean id="kde-background_blocker" key="Software\BaseALT\Policies\KDELocks" valueName="KSplash" >
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
      </elements>
    </policy>
  <policy name="kde-desktoptheme" class="User" displayName="$(string.kde-desktoptheme)"
    explainText="$(string.kde-desktoptheme_help)"
    presentation="$(presentation.kde-desktoptheme-user-pr)"
    key="Software\BaseALT\Policies\KDE\plasmarc\Theme">
    <parentCategory ref="system:ALT_Appearance_KDE" />
    <supportedOn ref="system:SUPPORTED_AltP10" />
      <elements>
        <enum  id="kde-desktoptheme-setter" valueName="name" required="true">
          <item displayName="$(string.kde-desktoptheme-default)">
            <value>
              <string>default</string>
            </value>
          </item>
          <item displayName="$(string.kde-desktoptheme-breeze-light)">
            <value>
              <string>breeze-light</string>
            </value>
          </item>
          <item displayName="$(string.kde-desktoptheme-breeze-dark)">
            <value>
              <string>breeze-dark</string>
            </value>
          </item>
          <item displayName="$(string.kde-desktoptheme-oxygen)">
            <value>
              <string>oxygen</string>
            </value>
          </item>
          <item displayName="$(string.kde-desktoptheme-air)">
            <value>
              <string>air</string>
            </value>
          </item>
        </enum>
        <boolean id="kde-desktoptheme_blocker" key="Software\BaseALT\Policies\KDELocks" valueName="name" >
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
      </elements>
    </policy>
  <policy name="kde-keyboardset" class="User" displayName="$(string.kde-keyboardset)"
    explainText="$(string.kde-keyboardset_help)"
    presentation="$(presentation.kde-keyboardset-user-pr)"
    key="Software\BaseALT\Policies\KDE">
    <parentCategory ref="system:ALT_Devices_KDE" />
    <supportedOn ref="system:SUPPORTED_AltP10" />
      <elements>
        <enum  id="kde-keyboardset-setter" valueName="kxkbrc.KeyBoard" required="true">
          <item displayName="$(string.kde-keyboardset-ru)">
            <value>
              <string>{"Layout":{"Use":"true", "LayoutList":"ru", "Model":"pc104"}}</string>
            </value>
          </item>
          <item displayName="$(string.kde-keyboardset-us)">
            <value>
              <string>{"Layout":{"Use":"true", "LayoutList":"us", "Model":"pc104"}}</string>
            </value>
          </item>
          <item displayName="$(string.kde-keyboardset-de)">
            <value>
              <string>{"Layout":{"Use":"true", "LayoutList":"de", "Model":"pc104"}}</string>
            </value>
          </item>
          <item displayName="$(string.kde-keyboardset-ru-us)">
            <value>
              <string>{"Layout":{"Use":"true", "DisplayNames":",", "LayoutList":"ru,us", "Model":"pc104", "VariantList":","}}</string>
            </value>
          </item>
          <item displayName="$(string.kde-keyboardset-ru-de)">
            <value>
              <string>{"Layout":{"Use":"true", "DisplayNames":",", "LayoutList":"ru,de", "Model":"pc104", "VariantList":","}}</string>
            </value>
          </item>
          <item displayName="$(string.kde-keyboardset-us-de)">
            <value>
              <string>{"Layout":{"Use":"true", "DisplayNames":",", "LayoutList":"us,de", "Model":"pc104", "VariantList":","}}</string>
            </value>
          </item>
        </enum>
        <boolean id="kde-keyboardset_blocker" key="Software\BaseALT\Policies\KDELocks" valueName="kxkbrc.KeyBoard" >
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
      </elements>
    </policy>
  <policy name="kde-browserapp" class="User" displayName="$(string.kde-browserapp)"
    explainText="$(string.kde-browserapp_help)"
    presentation="$(presentation.kde-browserapp-user-pr)"
    key="Software\BaseALT\Policies\KDE">
    <parentCategory ref="system:ALT_Application_KDE" />
    <supportedOn ref="system:SUPPORTED_AltP10" />
      <elements>
        <enum  id="kde-browserapp-setter" valueName="mimeapps.list.Browser" required="true">
          <item displayName="$(string.kde-browserapp-yandex)">
            <value>
              <string>{"Added Associations":{"x-scheme-handler/http":"yandex-browser.desktop;", "x-scheme-handler/https":"yandex-browser.desktop;"}, "Default Applications":{"x-scheme-handler/http":"yandex-browser.desktop;", "x-scheme-handler/https":"yandex-browser.desktop;"}}</string>
            </value>
          </item>
          <item displayName="$(string.kde-browserapp-firefox)">
            <value>
              <string>{"Added Associations":{"x-scheme-handler/http":"firefox.desktop;", "x-scheme-handler/https":"firefox.desktop;"}, "Default Applications":{"x-scheme-handler/http":"firefox.desktop;", "x-scheme-handler/https":"firefox.desktop;"}}</string>
            </value>
          </item>
          <item displayName="$(string.kde-browserapp-chromium)">
            <value>
              <string>{"Added Associations":{"x-scheme-handler/http":"chromium-gost.desktop;", "x-scheme-handler/https":"chromium-gost.desktop;"}, "Default Applications":{"x-scheme-handler/http":"chromium-gost.desktop;", "x-scheme-handler/https":"chromium-gost.desktop;"}}</string>
            </value>
          </item>
        </enum>
        <boolean id="kde-browserapp_blocker" key="Software\BaseALT\Policies\KDELocks" valueName="mimeapps.list.Browser" >
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
      </elements>
    </policy>
  <policy name="kde-wallpaper" class="User" displayName="$(string.kde-wallpaper)"
    explainText="$(string.kde-wallpaper_help)"
    presentation="$(presentation.kde-wallpaper-user-pr)"
    key="Software\BaseALT\Policies\KDE\plasma\wallpaperimage">
    <parentCategory ref="system:ALT_Appearance_KDE" />
    <supportedOn ref="system:SUPPORTED_AltP10" />
      <elements>
        <text id="kde-wallpaper-setter" valueName="Image"/>
      </elements>
    </policy>
  <policy name="kde-colorscheme" class="User" displayName="$(string.kde-colorscheme)"
    explainText="$(string.kde-colorscheme_help)"
    presentation="$(presentation.kde-colorscheme-user-pr)"
    key="Software\BaseALT\Policies\KDE\plasma\colorscheme">
    <parentCategory ref="system:ALT_Appearance_KDE" />
    <supportedOn ref="system:SUPPORTED_AltP10" />
      <elements>
        <text id="kde-colorscheme-setter" valueName="colorscheme"/>
      </elements>
    </policy>
  <policy name="kde-cursortheme" class="User" displayName="$(string.kde-cursortheme)"
    explainText="$(string.kde-cursortheme_help)"
    presentation="$(presentation.kde-cursortheme-user-pr)"
    key="Software\BaseALT\Policies\KDE\plasma\cursortheme">
    <parentCategory ref="system:ALT_Appearance_KDE" />
    <supportedOn ref="system:SUPPORTED_AltP10" />
      <elements>
        <text id="kde-cursortheme-setter" valueName="cursortheme"/>
      </elements>
    </policy>
  <policy name="kde-graphic-effects" class="Both" displayName="$(string.kde-graphic-effects)"
      explainText="$(string.kde-graphic-effects_help)"
      presentation="$(presentation.kde-graphic-effects-user-pr)"
      key="Software\BaseALT\Policies\KDE\kwinrc\Compositing">
      <parentCategory ref="system:ALT_Settings_KDE"/>
      <supportedOn ref="system:SUPPORTED_AltP10"/>
      <elements>
        <boolean id="kde-graphic-effects_setter" valueName="Enabled">
            <trueValue>
              <decimal value="1" />
            </trueValue>
            <falseValue>
              <decimal value="0" />
            </falseValue>
            </boolean>
        <boolean id="kde-graphic-effects_blocker" key="Software\BaseALT\Policies\KDELocks" valueName="Enabled" >
            <trueValue>
              <decimal value="1" />
            </trueValue>
            <falseValue>
              <decimal value="0" />
            </falseValue>
            </boolean>
      </elements>
    </policy>
  <policy name="kde-showdelete" class="User" displayName="$(string.kde-showdelete)"
      explainText="$(string.kde-showdelete_help)"
      presentation="$(presentation.kde-showdelete-user-pr)"
      key="Software\BaseALT\Policies\KDE\kdeglobals\KDE">
      <parentCategory ref="system:ALT_Settings_KDE"/>
      <supportedOn ref="system:SUPPORTED_AltP10"/>
    <elements>
      <boolean id="kde-showdelete_setter" valueName="ShowDeleteCommand">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
      <boolean id="kde-showdelete_blocker" key="Software\BaseALT\Policies\KDELocks" valueName="ShowDeleteCommand" >
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
    </elements>
      </policy>
  <policy name="kde-singleclick" class="User" displayName="$(string.kde-singleclick)"
      explainText="$(string.kde-singleclick_help)"
      presentation="$(presentation.kde-singleclick-user-pr)"
      key="Software\BaseALT\Policies\KDE\kdeglobals\KDE">
      <parentCategory ref="system:ALT_Settings_KDE"/>
      <supportedOn ref="system:SUPPORTED_AltP10"/>
      <elements>
      <boolean id="kde-singleclick_setter" valueName="SingleClick">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
      <boolean id="kde-singleclick_blocker" key="Software\BaseALT\Policies\KDELocks" valueName="SingleClick" >
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
          </boolean>
    </elements>
    </policy>
  </policies>
</policyDefinitions>