<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2019 BaseALT, Ltd.  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions" revision="1.0" schemaVersion="1.0">
  <displayName>ALT services definitions</displayName>
  <description>This file contains the gsettings services definitions used by ALT operating system.</description>
  <resources>
    <stringTable>
      <string id="org-mate-background-secondary-color">Final gradient color</string>
      <string id="org-mate-background-secondary-color_help">Set right or bottom color when drawing the gradient. Doesn't apply to solid color.</string>

      <string id="org-mate-background-picture-options">Desktop background options</string>
      <string id="org-mate-background-picture-options_help">Set how to display the desktop background. Possible values: "none", "wallpaper", "centered", "scaled", "stretched", "zoom", "spanned".</string>
      <string id="org-mate-background-picture-options_None">none</string>
      <string id="org-mate-background-picture-options_Wallpaper">wallpaper</string>
      <string id="org-mate-background-picture-options_Centered">centered</string>
      <string id="org-mate-background-picture-options_Scaled">scaled</string>
      <string id="org-mate-background-picture-options_Stretched">stretched</string>
      <string id="org-mate-background-picture-options_Zoom">zoom</string>
      <string id="org-mate-background-picture-options_Spanned">spanned</string>

      <string id="org-mate-background-color-shading-type">Gradient type</string>
      <string id="org-mate-background-color-shading-type_help">Set the gradient type: vertical, horizontal, or solid fill.</string>
      <string id="org-mate-background-color-shading-type-horizontal-gradient">horizontal gradient</string>
      <string id="org-mate-background-color-shading-type-vertical-gradient">vertical gradient</string>
      <string id="org-mate-background-color-shading-type-solid">solid fill</string>

      <string id="org-mate-background-picture-filename">Desktop background image</string>
      <string id="org-mate-background-picture-filename_help">Set the image to use as the desktop background.</string>

      <string id="org-mate-background-primary-color">The initial color of the gradient (solid fill color)</string>
      <string id="org-mate-background-primary-color_help">Set left, top, or solid color to be used for the gradient, depending on the defined gradient type.</string>

      <string id="org-mate-screensaver-idle-activation-enabled">Screen saver</string>
      <string id="org-mate-screensaver-idle-activation-enabled_help">Turn on screen saver while idle.</string>

      <string id="org-mate-screensaver-lock-enabled">Screen lock</string>
      <string id="org-mate-screensaver-lock-enabled_help">Enable, to lock the computer while screen saver is active. Computer will be locked after the time interval set by the "Lock delay" setting.</string>

      <string id="org-mate-screensaver-mode">Screen saver mode</string>
      <string id="org-mate-screensaver-mode_help">Set screen saver mode. Possible options: "disabled" — disabled, "blank-only" — an empty screen,"single" — use one theme specified by the "themes" key,"random" — use a randomly selected theme.</string>
      <string id="org-mate-screensaver-mode_disabled">disabled</string>
      <string id="org-mate-screensaver-mode_blank_only">blank screen</string>
      <string id="org-mate-screensaver-mode_random">random</string>
      <string id="org-mate-screensaver-mode_single">single</string>

      <string id="org-mate-screensaver-lock-delay">Lock delay</string>
      <string id="org-mate-screensaver-lock-delay_help">Set the delay in minutes between screen saver activation and computer lock.</string>

      <string id="org-mate-screensaver-logout-delay">Logout delay</string>
      <string id="org-mate-screensaver-logout-delay_help">Set the delay in minutes between screen saver activation and automatic logout. This setting is active if the "User logout after blocking" setting is enabled.</string>

      <string id="org-mate-screensaver-cycle-delay">Screensaver cycle delay</string>
      <string id="org-mate-screensaver-cycle-delay_help">Set the delay for screen saver theme cycle.</string>

      <string id="org-mate-screensaver-user-switch-enabled">Switching user after blocking</string>
      <string id="org-mate-screensaver-user-switch-enabled_help">Enable to allow switching to another account in the screen unlock dialog.</string>

      <string id="org-mate-screensaver-logout-enabled">User logout after blocking</string>
      <string id="org-mate-screensaver-logout-enabled_help">Enable to allow logging out in the screen unlock dialog. The delay is specified in the "Logout delay" setting.</string>

      <string id="org-mate-lockdown-disable-log-out">Forbid log out </string>
      <string id="org-mate-lockdown-disable-log-out_help">Enable to prevent the user from ending the session.</string>

      <string id="org-mate-lockdown-disable-lock-screen">Disable screen lock</string>
      <string id="org-mate-lockdown-disable-lock-screen_help">Set to disable automatic screen lock.</string>

      <string id="org-mate-lockdown-disable-user-switching">Forbid user switching</string>
      <string id="org-mate-lockdown-disable-user-switching_help">Enable to prevent the user from switching to another account while their session is active.</string>

      <string id="org-mate-lockdown-disable-theme-settings">Forbid desktop theme customization</string>
      <string id="org-mate-lockdown-disable-theme-settings_help">Enabled to prevent the user from changing theme setthings.</string>

      <string id="org-gnome-vino-view-only">Remote control</string>
      <string id="org-gnome-vino-view-only_help">If true, remote users accessing the desktop are only allowed to view the desktop. Remote users will not be able to use the mouse or keyboard.</string>

      <string id="org-gnome-vino-prompt-enabled">Confirmation when connecting</string>
      <string id="org-gnome-vino-prompt-enabled_help">If true, remote users accessing the desktop are not allowed access until the user on the host machine approves the connection. Recommended when access is not password protected.</string>

      <string id="org-gnome-vino-icon-visibility">Connection icon</string>
      <string id="org-gnome-vino-icon-visibility_help">This key controls the behavior of the connection status icon. There are three options: "always" - the icon will always be present; "client" - the icon will only be present when someone is connected (this is the default behavior); "never" - the icon will not be present.</string>
      <string id="org-gnome-vino-icon-visibility-never">never</string>
      <string id="org-gnome-vino-icon-visibility-always">always</string>
      <string id="org-gnome-vino-icon-visibility-client">client</string>

      <string id="org-gnome-vino-enabled">Remote access</string>
      <string id="org-gnome-vino-enabled_help">If true, allows remote access to desktop via the RFB protocol. Users on remote machines may then connect to the desktop using a VNC player.</string>

      <string id="org-gnome-vino-alternative-port">Alternative port</string>
      <string id="org-gnome-vino-alternative-port_help">The port which the server will listen to if the 'use-alternative-port' key is set to true. Valid values are in the range of 5000 to 50000.</string>

      <string id="org-gnome-vino-use-alternative-port">Enable alternative port</string>
      <string id="org-gnome-vino-use-alternative-port_help">If true, the server will listen on another port, instead of the default (5900). The port must be specified in the 'alternative-port' key.</string>

      <string id="org-gnome-vino-authentication-methods">Authentication methods</string>
      <string id="org-gnome-vino-authentication-methods_help">Lists the authentication methods with which remote users may access the desktop.  There are two possible authentication methods; "vnc" causes the remote user to be prompted for a password (the password is specified by the vnc-password key) before connecting and "none" which allows any remote user to connect.</string>
      <string id="org-gnome-vino-authentication-methods-none">none</string>
      <string id="org-gnome-vino-authentication-methods-vnc">vnc</string>

      <string id="org-gnome-vino-vnc-password">Password for remote access</string>
      <string id="org-gnome-vino-vnc-password_help">The password which the remote user will be prompted for if the "vnc" authentication method is used. The password specified by the key is base64 encoded.  The special value of 'keyring' (which is not valid base64) means that the password is stored in the GNOME keyring.</string>

    </stringTable>

    <presentationTable>
      <presentation id="OrgMateBackgroundSecondaryColorMachine-pr">
        <textBox refId="OrgMateBackgroundSecondaryColor_setter">
          <label>Set the color:</label>
        </textBox>
        <checkBox refId="OrgMateBackgroundSecondaryColor_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgMateBackgroundSecondaryColor_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgMateBackgroundSecondaryColorUser-pr">
        <textBox refId="OrgMateBackgroundSecondaryColor_setter">
          <label>Set the color:</label>
        </textBox>
      </presentation>

      <presentation id="OrgMateBackgroundPictureOptionsUser-pr">
        <dropdownList noSort="true" defaultItem="0" refId="OrgMateBackgroundPictureOptions_setter">Method for displaying the desktop background:</dropdownList>
      </presentation>

      <presentation id="OrgMateBackgroundPictureOptionsMachine-pr">
        <dropdownList noSort="true" defaultItem="0" refId="OrgMateBackgroundPictureOptions_setter">Method for displaying the desktop background:</dropdownList>
        <checkBox refId="OrgMateBackgroundPictureOptions_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgMateBackgroundPictureOptions_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgMateBackgroundColorShadingTypeUser-pr">
        <dropdownList noSort="true" defaultItem="0" refId="OrgMateBackgroundColorShadingType_setter">Set the gradient type:</dropdownList>
      </presentation>

      <presentation id="OrgMateBackgroundColorShadingTypeMachine-pr">
        <dropdownList noSort="true" defaultItem="0" refId="OrgMateBackgroundColorShadingType_setter">Set the gradient type:</dropdownList>
        <checkBox refId="OrgMateBackgroundColorShadingType_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgMateBackgroundColorShadingType_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgMateBackgroundPictureFilenameUser-pr">
        <textBox refId="OrgMateBackgroundPictureFilename_setter">
          <label>file:</label>
        </textBox>
      </presentation>

      <presentation id="OrgMateBackgroundPictureFilenameMachine-pr">
        <textBox refId="OrgMateBackgroundPictureFilename_setter">
          <label>file:</label>
        </textBox>
        <checkBox refId="OrgMateBackgroundPictureFilename_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgMateBackgroundPictureFilename_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgMateBackgroundPrimaryColorUser-pr">
        <textBox refId="OrgMateBackgroundPrimaryColor_setter">
          <label>Set the color:</label>
        </textBox>
      </presentation>

      <presentation id="OrgMateBackgroundPrimaryColorMachine-pr">
        <textBox refId="OrgMateBackgroundPrimaryColor_setter">
          <label>Set the color:</label>
        </textBox>
        <checkBox refId="OrgMateBackgroundPrimaryColor_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgMateBackgroundPrimaryColor_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgMateScreesaverIdleActivationEnabledMachine-pr">
        <checkBox refId="OrgMateScreesaverIdleActivationEnabled_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgMateScreesaverIdleActivationEnabled_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgMateScreensaverLockEnabledMachine-pr">
        <checkBox refId="OrgMateScreensaverLockEnabled_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgMateScreensaverLockEnabled_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgMateScreensaverModeUser-pr">
        <dropdownList noSort="true" defaultItem="0" refId="OrgMateScreensaverMode_setter">Select an operating mode:</dropdownList>
      </presentation>

      <presentation id="OrgMateScreensaverModeMachine-pr">
        <dropdownList noSort="true" defaultItem="0" refId="OrgMateScreensaverMode_setter">Select an operating mode:</dropdownList>
        <checkBox refId="OrgMateScreensaverMode_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgMateScreensaverMode_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgMateScreensaverLockDelayUser-pr">
        <text>The interval in minutes between the activation of the screen saver and the appearance of the logout dialog during activation</text>
        <decimalTextBox refId="OrgMateScreensaverLockDelay_setter" defaultValue="2">Time in minutes:</decimalTextBox>
      </presentation>

      <presentation id="OrgMateScreensaverLockDelayMachine-pr">
        <text>The interval in minutes between the activation of the screen saver and the appearance of the logout dialog during activation</text>
        <decimalTextBox refId="OrgMateScreensaverLockDelay_setter" defaultValue="2">Time in minutes:</decimalTextBox>
        <checkBox refId="OrgMateScreensaverLockDelay_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgMateScreensaverLockDelay_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgMateScreensaverLogoutDelayUser-pr">
        <text>The number of minutes after which, after activating the screen saver, the screen will be locked</text>
        <decimalTextBox refId="OrgMateScreensaverLogoutDelay_setter" defaultValue="3">Time in minutes:</decimalTextBox>
      </presentation>

      <presentation id="OrgMateScreensaverLogoutDelayMachine-pr">
        <text>The number of minutes after which, after activating the screen saver, the screen will be locked</text>
        <decimalTextBox refId="OrgMateScreensaverLogoutDelay_setter" defaultValue="3">Time in minutes:</decimalTextBox>
        <checkBox refId="OrgMateScreensaverLogoutDelay_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgMateScreensaverLogoutDelay_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgMateScreensaverCycleDelayUser-pr">
        <text>The interval in minutes between changing the themes of the screen saver</text>
        <decimalTextBox refId="OrgMateScreensaverCycleDelay_setter" defaultValue="2">Time in minutes:</decimalTextBox>
      </presentation>

      <presentation id="OrgMateScreensaverCycleDelayMachine-pr">
        <text>The interval in minutes between changing the themes of the screen saver</text>
        <decimalTextBox refId="OrgMateScreensaverCycleDelay_setter" defaultValue="2">Time in minutes:</decimalTextBox>
        <checkBox refId="OrgMateScreensaverCycleDelay_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgMateScreensaverCycleDelay_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgMateScreensaverLogoutEnabledMachine-pr">
        <checkBox refId="OrgMateScreensaverLogoutEnabled_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgMateScreensaverLogoutEnabled_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgMateScreensaverUserSwitchEnabledMachine-pr">
        <checkBox refId="OrgMateScreensaverUserSwitchEnabled_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgMateScreensaverUserSwitchEnabled_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgMateLockdownDisableLogOutMachine-pr">
        <checkBox refId="OrgMateLockdownDisableLogOut_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgMateLockdownDisableLogOut_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgMateLockdownDisableLockScreenMachine-pr">
        <checkBox refId="OrgMateLockdownDisableLockScreen_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgMateLockdownDisableLockScreen_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgMateLockdownDisableUserSwitchingMachine-pr">
        <checkBox refId="OrgMateLockdownDisableUserSwitching_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgMateLockdownDisableUserSwitching_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgMateLockdownDisableThemeSettingsMachine-pr">
        <checkBox refId="OrgMateLockdownDisableThemeSettings_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgMateLockdownDisableThemeSettings_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgGnomeVinoViewOnlyMachine-pr">
        <checkBox refId="OrgGnomeVinoViewOnly_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgGnomeVinoViewOnly_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgGnomeVinoPromptEnabledMachine-pr">
        <checkBox refId="OrgGnomeVinoPromptEnabled_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgGnomeVinoPromptEnabled_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgGnomeVinoIconVisibilityUser-pr">
        <dropdownList noSort="true" defaultItem="0" refId="OrgGnomeVinoIconVisibility_setter">Show notification:</dropdownList>
      </presentation>

      <presentation id="OrgGnomeVinoIconVisibilityMachine-pr">
        <dropdownList noSort="true" defaultItem="0" refId="OrgGnomeVinoIconVisibility_setter">Show notification:</dropdownList>
        <checkBox refId="OrgGnomeVinoIconVisibility_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgGnomeVinoIconVisibility_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgGnomeVinoEnabledMachine-pr">
        <checkBox refId="OrgGnomeVinoEnabled_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgGnomeVinoEnabled_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgGnomeVinoAlternativePortUser-pr">
        <decimalTextBox refId="OrgGnomeVinoAlternativePort_setter" defaultValue="5000">Port:</decimalTextBox>
      </presentation>

      <presentation id="OrgGnomeVinoAlternativePortMachine-pr">
        <decimalTextBox refId="OrgGnomeVinoAlternativePort_setter" defaultValue="5000">Port:</decimalTextBox>
        <checkBox refId="OrgGnomeVinoAlternativePort_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgGnomeVinoAlternativePort_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgGnomeVinoUseAlternativePortMachine-pr">
        <checkBox refId="OrgGnomeVinoUseAlternativePort_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgGnomeVinoUseAlternativePort_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgGnomeVinoAuthenticationMethodsUser-pr">
        <dropdownList noSort="true" defaultItem="0" refId="OrgGnomeVinoAuthenticationMethods_setter">Method:</dropdownList>
      </presentation>

      <presentation id="OrgGnomeVinoAuthenticationMethodsMachine-pr">
        <dropdownList noSort="true" defaultItem="0" refId="OrgGnomeVinoAuthenticationMethods_setter">Method:</dropdownList>
        <checkBox refId="OrgGnomeVinoAuthenticationMethods_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgGnomeVinoAuthenticationMethods_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

      <presentation id="OrgGnomeVinoVncPasswordUser-pr">
        <textBox refId="OrgGnomeVinoVncPassword_setter">
          <label>Password:</label>
        </textBox>
      </presentation>

      <presentation id="OrgGnomeVinoVncPasswordMachine-pr">
        <textBox refId="OrgGnomeVinoVncPassword_setter">
          <label>Password:</label>
        </textBox>
        <checkBox refId="OrgGnomeVinoVncPassword_setter_blocker">lock</checkBox>
        <text>Lock changes to this setting. User policies for this setting will be ignored.</text>
        <checkBox refId="OrgGnomeVinoVncPassword_setter_default" defaultChecked = "true">by default</checkBox>
        <text>Set as the default value for the computer. In the disabled state, it will be distributed as a setting for the user with the lowest priority.</text>
      </presentation>

    </presentationTable>
  </resources>
</policyDefinitionResources>
